Membalik Urutan Baris dan Kolom

In [12]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.3
2.1.3

In [6]:
n_baris=5
n_kolom=5
kolom=tuple('ABCDE')

data = pd.DataFrame(np.random.randint(1,10,size=(n_baris,n_kolom)), columns=kolom)

data

   A  B  C  D  E
0  9  2  9  6  2
1  9  8  6  4  3
2  9  9  4  4  7
3  8  2  8  5  5
4  4  3  9  9  4

Membalik urutan kolom dari data di atas menggunakan 'loc'

In [7]:
data.loc[:,::-1]

   E  D  C  B  A
0  2  6  9  2  9
1  3  4  6  8  9
2  7  4  4  9  9
3  5  5  8  2  8
4  4  9  9  3  4

Kemudian untuk membalik baris caranya hampir mirip, sebelumnya caranya dapat mengacu pada penulisan koordinat (baris, kolom). Jika ingin membalik baris saja kiuta dapat mengabaikan kolom dan hanya menuliskan barisnya saja dengan notasi pembalik yang sama seperti sebelumnya.

In [13]:
data.loc[::-1]

   A  B  C  D  E
4  4  3  9  9  4
3  8  2  8  5  5
2  9  9  4  4  7
1  9  8  6  4  3
0  9  2  9  6  2

nah di sini kita membalik barisnya, bisa dilihat bahwa kita mengabaikan yang namanya kolom di sana dan itu bisa-bisa saja karena kita anggap kolomnya tidak berubah. Itu akan sama saja jika kita membuatnya hampir sama dengan membali kolom, yakni dengan menuliskan titik 2 di bagian kolom

In [14]:
data.loc[::-1, :]

   A  B  C  D  E
4  4  3  9  9  4
3  8  2  8  5  5
2  9  9  4  4  7
1  9  8  6  4  3
0  9  2  9  6  2

Jika kita ingin membalik barisnya tanpa mengubah urutan indeksnya maka kita akan melakukan seperti berikut

In [16]:
data.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  4  3  9  9  4
1  8  2  8  5  5
2  9  9  4  4  7
3  9  8  6  4  3
4  9  2  9  6  2